import csv
import numpy as np
import matplotlib.pyplot as plt
from scipy import interpolate
from scipy.sparse.csgraph import connected_components
from scipy.sparse import csr_matrix
from scipy.sparse.csgraph import shortest_path



with open("data.csv") as data_name: #відкриваємо файл "data.csv"
    array = np.loadtxt(data_name, delimiter=";") #завантажуємо дані з роздільником ';'
    City = open('City.txt') #відкриваємо файл 'City.txt'
    city = City.readlines() #завантажуємо дані порядково

city1 = [] #створюємо список
for word in city:
    result = word.replace('\n', '') #замінюємо в списку city '\n' на ''
    city1.append(result) # і заносимо ці дані до нового списку
graph = csr_matrix(array) # Створюємо стиснуту матрицю нашого графу
dist_matrix, predecessors = shortest_path(csgraph=graph, directed=False, indices=0, return_predecessors=True) #виконуємо пошук графа найкоротшого шляху

def Future(k): # створюємо функцію (де інтерполюємо дані) для полегшення виводу наступних даних
    y_mass = []
    y_mass.append(dist_matrix[k])
    x = np.arange(2022, 2027) #створюємо масив років
    for i in range(1, len(x)):
        y_mass.append(y_mass[i-1] * 1.05)
    f = interpolate.interp1d(x, y_mass)     #створюємо функцію інтерполяції списків
    xnew = np.arange(2022, 2027)          #створюємо масив років
    ynew = f(xnew)   # використовуємо функцію інтерполяції, яка повертає `interp1d`
    plt.plot(x, y_mass, 'o', xnew, ynew, 'r--')  #створюємо графік підвищення цін на перельоти відносно років
    plt.xlabel('Роки') # підписуємо вісь х
    plt.ylabel('Ціна в $') # підписуємо вісь у
    plt.grid(True) # виводимо сітку графіку

    plt.show()  #виводимо графік

#створюємо меню
print("\n*-*-*-*-*-*-*-*-*-*-*-*-*-*-* ПРИВІТ! ВІТАЄМО ВАС НА НАШОМУ САЙТІ *-*-*-*-*-*-*-*-*-*-*-*-*-*-*\n")

final = 1
while(final == 1):
    print("************************************************************************************************\n")
    print("Якщо бажаєте вибрати місто в яке полетіти, то натисніть 1\n")
    print("Якщо бажаєте вивести всі ціни на перельоти, то натисніть 2\n")
    print("Якщо бажаєте вивести подорожчання цін перельоту до місту Amsterdam на наступні 5 років, то натисніть 3\n")
    print("Якщо бажаєте вивести подорожчання цін перельоту до місту Paris на наступні 5 років, то натисніть 4\n")
    print("Якщо бажаєте вивести подорожчання цін перельоту до місту Berlin на наступні 5 років, то натисніть 5\n")
    print("Якщо бажаєте вивести подорожчання цін перельоту до місту Munchen на наступні 5 років, то натисніть 6\n")
    print("Якщо бажаєте вивести подорожчання цін перельоту до місту Milano на наступні 5 років, то натисніть 7\n")
    print("Якщо бажаєте вивести подорожчання цін перельоту до місту Praha на наступні 5 років, то натисніть 8\n")
    print("Якщо бажаєте вивести подорожчання цін перельоту до місту Wien на наступні 5 років, то натисніть 9\n")
    print("Якщо бажаєте вивести подорожчання цін перельоту до місту Rome на наступні 5 років, то натисніть 10\n")
    print("Якщо бажаєте вивести подорожчання цін перельоту до місту Warszawa на наступні 5 років, то натисніть 11\n")
    print("Якщо бажаєте вивести подорожчання цін перельоту до місту Budapest на наступні 5 років, то натисніть 12\n")

    print("\n************************************************************************************************\n")
    index = int(input("Ваш вибір: "))
    print("\n************************************************************************************************\n")
    
    if(index == 1):
        print("Ви можете полетіти в такі міста, як: ")
        for i in range(1, len(dist_matrix)):
            print(city[i])

        name = str(input("Введіть назву міста, в яке ви вирішили полетіти... "))
           
        schet = 0

        for i in range(1, len(dist_matrix)):
            if(city1[i] == name):
                print("З міста ", city1[0], "до міста ", city1[i], " переліт коштує ", dist_matrix[i], "$")
                schet = 1

        if(schet == 0):
            print("Такого міста не існує")
        print("\n************************************************************************************************\n")
        
        final = int(input("Якщо бажаєте продовжити, то натисніть '1', якщо ні, то натисніть '0': "))        
        if(final == 0):
            print("\n*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-* ДО ПОБАЧЕННЯ! *-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*\n")
            
            
    if(index == 2):
        for i in range(1, len(dist_matrix)):
            print("З міста ", city1[0], "до міста ", city1[i], " переліт коштує ", dist_matrix[i], "$")
        print("\n************************************************************************************************\n")
        final = int(input("Якщо бажаєте продовжити, то натисніть '1', якщо ні, то натисніть '0': "))
        if(final == 0):
            print("\n*-*-*-*-*-*-*-*-*-*-*-*-*-*-* ДО ПОБАЧЕННЯ! *-*-*-*-*-*-*-*-*-*-*-*-*-*-*\n")    

    if(index > 2 and index < 13):
        k = index - 2
        print("Місто ", city1[k])
        Future(k)
        print("\n************************************************************************************************\n")
        final = int(input("Якщо бажаєте продовжити, то натисніть '1', якщо ні, то натисніть '0': "))
        if(final == 0):
            print("\n*-*-*-*-*-*-*-*-*-*-*-*-*-*-* ДО ПОБАЧЕННЯ! *-*-*-*-*-*-*-*-*-*-*-*-*-*-*\n")
